artillery/POST.yml
config:
  target: 'http://localhost:4420'
  phases:
    - duration: 60
      arrivalRate: 1
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - post:
        url: "/rooms"
        json: 
          "amenities": 
            "\"Air conditioning\"": true
            "\"Bathroom essentials\"": true
            "\"Bedroom comforts\"": true
            "\"Carbon monoxide detector\"": true
            "\"Coffee maker\"": true
            "\"Dish washer\"": true
            "\"Dryer\"": true
            "\"Hair dryer\"": true
            "\"Heating\"": true
            "\"Indoor fireplace\"": true
            "\"Iron\"": true
            "\"Kitchen\"": true
            "\"Pets allowed\"": true
            "\"Pool\"": true
            "\"roomname\"": "'roomUpdated1234567'"
            "\"Self check-in\"": true
            "\"Smoke detector\"": true
            "\"TV\"": true
            "\"Washer\"": true
            "\"Wifi\"": true